<a href="https://colab.research.google.com/github/ShyamKumarChand/Assignment1/blob/main/Html.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"
BB_data = pd.read_html(url)

In [3]:
BB_data[0].head()

  Rk         Player Pos Age   Tm   G  GS  ...  TRB  AST STL BLK  TOV   PF   PTS
0  1     Quincy Acy  PF  24  NYK  68  22  ...  301   68  27  22   60  147   398
1  2   Jordan Adams  SG  20  MEM  30   0  ...   28   16  16   7   14   24    94
2  3   Steven Adams   C  21  OKC  70  67  ...  523   66  38  86   99  222   537
3  4    Jeff Adrien  PF  28  MIN  17   0  ...   77   15   4   9    9   30    60
4  5  Arron Afflalo  SG  29  TOT  78  72  ...  247  129  41   7  116  167  1035

[5 rows x 30 columns]

In [4]:
BB_data[0].columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [5]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [6]:
type(titanic_train)

pandas.core.frame.DataFrame

In [7]:
titanic_train[['Parch','Survived']].head(2)

   Parch  Survived
0      0         0
1      0         1

In [8]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
pd.options.display.max_rows = 6

In [10]:
titanic_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[156 rows x 12 columns]